2024-1-18/6d537c26fc-RECD.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-22 Wed 17:05 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>宏里面无法直接使用sizeof</title>
<meta name="author" content="Yang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">宏里面无法直接使用sizeof</h1>
<p>
<a href="https://www.coder.work/article/1558363">https://www.coder.work/article/1558363</a>
不被允许的形式：
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">  #if</span> <span style="font-weight: bold;">sizeof</span>(someThing) != PAGE_SIZE
<span style="font-weight: bold;">  #error</span> <span style="font-style: italic;">Data structure doesn</span><span style="font-weight: bold;">'</span><span style="font-style: italic;">t match page size</span>
<span style="font-weight: bold;">  #endif</span>
</pre>
</div>

<p>
linux kernel提供有如下方法：
用在全局的：static_assert();
</p>
<div class="org-src-container">
<pre class="src src-c">  <span style="font-weight: bold;">static_assert</span>(NSIGSYS == 2);
  static_assert(<span style="font-weight: bold;">sizeof</span>(siginfo_t) == 128);
  <span style="font-weight: bold;">static_assert</span>(<span style="font-weight: bold; text-decoration: underline;">__alignof__</span>(<span style="font-weight: bold; font-style: italic;">siginfo_t</span>) == 4);
  <span style="font-weight: bold;">static_assert</span>(offsetof(<span style="font-weight: bold; text-decoration: underline;">siginfo_t</span>, si_signo)   == 0x00);
</pre>
</div>
<p>
用在函数内：BUILD_BUG_ON();
</p>
<div class="org-src-container">
<pre class="src src-c">  <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold; font-style: italic;">__init</span> mem_init(<span style="font-weight: bold; text-decoration: underline;">void</span>)
  {
          memblock_free_all();
          highmem_init();

          BUILD_BUG_ON((PTRS_PER_PGD * <span style="font-weight: bold;">sizeof</span>(pgd_t)) &gt; PAGE_SIZE);
          BUILD_BUG_ON((PTRS_PER_PUD * <span style="font-weight: bold;">sizeof</span>(pud_t)) &gt; PAGE_SIZE);
          BUILD_BUG_ON((PTRS_PER_PMD * <span style="font-weight: bold;">sizeof</span>(pmd_t)) &gt; PAGE_SIZE);
          BUILD_BUG_ON((PTRS_PER_PTE * <span style="font-weight: bold;">sizeof</span>(pte_t)) &gt; PAGE_SIZE);
  }
</pre>
</div>
<p>
以及函数内：compiletime_assert():
</p>
<div class="org-src-container">
<pre class="src src-c">  <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">ec_input_read</span>(<span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">ariel_pwrbutton</span> *<span style="font-weight: bold; font-style: italic;">priv</span>,
                           <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">ec_input_response</span> *<span style="font-weight: bold; font-style: italic;">response</span>)
  {
          <span style="font-weight: bold; text-decoration: underline;">u8</span> <span style="font-weight: bold; font-style: italic;">read_request</span>[] = { 0x00, 0x5a, 0xa5, 0x00, 0x00 };
          <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">spi_device</span> *<span style="font-weight: bold; font-style: italic;">spi</span> = priv-&gt;client;
          <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">spi_transfer</span> <span style="font-weight: bold; font-style: italic;">t</span> = {
                  .tx_buf = read_request,
                  .rx_buf = response,
                  .len = <span style="font-weight: bold;">sizeof</span>(read_request),
          };

          compiletime_assert(<span style="font-weight: bold;">sizeof</span>(read_request) == <span style="font-weight: bold;">sizeof</span>(*response),
                             <span style="font-style: italic;">"SPI xfer request/response size mismatch"</span>);

          <span style="font-weight: bold;">return</span> spi_sync_transfer(spi, &amp;t, 1);
  }
</pre>
</div>
<p>
另外BUILD_BUG_ON()的一种实现是：
#define BUILD_BUG_ON(condition) ((void)sizeof(char[1 - 2*!!(condition)]))
当condition为true时，会求一个sizeof(char[-1])的大小，会报错
condition为false时，不会。</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yang</p>
<p class="date">Created: 2024-05-22 Wed 17:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
